local E = select(2, ...):unpack()

E.Config.enemySpells = {

    -- 수문 --
    [462771] = {name = "조사광선"},
    [1214780] = {name = "최대 왜곡"},
    [461796] = {name = "재장전"},
    [468631] = {name = "작살"},
    [465595] = {name = "재장전"},
    [465595] = {name = "번개화살"},
    [465871] = {name = "핏빛작렬"},


    -- 신불수 --
    [427469] = {name = "화염구"},
    [427356] = {name = "화염구"},
    [427743] = {name = "연발"},
    [427432] = {name = "방어"},
    [427357] = {name = "성격"},
    [424421] = {name = "화염구"},
    [423536] = {name = "성격"},

    -- 양조장 --
    [437721] = {name = "빨대"},
    [441242] = {name = "무료 시식"},
    [441351] = {name = "분노"},
    [440687] = {name="연발"},
    [438971] = {name="분쇄 독침"},

    -- 어불동 --
    [423479] = {name = "화살"},
    [424322] = {name = "불길"},
    [426145] = {name = "공포"},

    -- 부화장 --
    [430109] = {name = "번화"},
    [430237] = {name = "화살"},
    [430238] = {name = "화살"},

    -- 왕노 --
    [280604] = {name = "얼린음료"},
    [269302] = {name = "맹독"},
    [267354] = {name = "칼부"},
    [263202] = {name = "바위창"},
    [268702] = {name = "지진"},
    [268797] = {name = "슬라임"},

    -- 고투 --
    [1217138] = {name = "괴저화살"},
    [330868] = {name = "연발"},
    [342675] = {name = "뼈창"},
    [1216475] = {name = "괴저화살"},
    [341969] = {name = "방출"},
    [330703] = {name ="오물"},
    [330784] = {name = "화살"},

    -- 작업장 --
    [301088] = {name = "폭파"},
    [293827] = {name = "초강력맹타"},
    [1215412] = {name = "오물"}
}